Configuration/Documents/бит_ум_КвитанцияЗаПатент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ум_КвитанцияЗаПатент</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_ум_ОплатаПатентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_РазрезыДокументовИР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/AccumulationRegisters/бит_ум_ОплатаПатентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_ум_ОплатаПатентов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разрез</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_РазрезыДокументовИР</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Configuration/InformationRegisters/бит_ум_ДокументыИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ум_ДокументыИР</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопПоле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТерриторияДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГосударственныйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ГосударственныеОрганы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопПоле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСубъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ВидыДокументовИР</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разрез</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_РазрезыДокументовИР</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/Documents/бит_ум_КвитанцияЗаПатент/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ бит_ум_УчетМигрантовСервер.ПолучитьЛицензию(Истина) Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;	
	
	КадровыйУчетФормы.ФормаКадровогоДокументаПриСозданииНаСервере(ЭтаФорма);
	
   	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
		УстановитьФункциональныеОпцииФормы();
		ЗаполнитьДанныеСвязанныеССотрудником();
		СотрудникПриИзмененииНаСервере(Параметры.Ключ.Пустая());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом	
	
	ПодготовитьФормуНаСервере();
	УстановитьФункциональныеОпцииФормы();
	СотрудникПриИзмененииНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом	

	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
 	// СтандартныеПодсистемы.ПодключаемыеКоманды
 	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
 	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	ЗаполнитьДанныеСвязанныеССотрудником();
	СотрудникПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	СотрудникПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура РазрезПриИзменении(Элемент)

	СотрудникПриИзмененииНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Функция СостояниеДокумента(Объект)
	
	РучнаяКорректировка = Неопределено;
	
	Если Объект.ПометкаУдаления Тогда
		СостояниеДокумента = 2;
	ИначеЕсли Объект.Проведен Тогда
		СостояниеДокумента = 1;
	Иначе
		СостояниеДокумента = 0;
	КонецЕсли;
	
	Возврат СостояниеДокумента;
	
КонецФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	УстановитьФункциональныеОпцииФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	ПараметрыФО = Новый Структура("Организация, Период", Объект.Организация, Объект.Дата);
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере(ЗаполнитьДату = Ложь)
	
	Если НЕ ЗначениеЗаполнено(Объект.ФизическоеЛицо) ИЛИ НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Элементы.ГруппаПатент.Видимость = Ложь;
		Элементы.Разрез.СписокВыбора.Очистить();
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ФизическоеЛицо", Объект.ФизическоеЛицо);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Граница", Новый Граница(Объект.Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Разрез", Объект.Разрез);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(МАКСИМУМ(ОплатаПатентовОбороты.ПериодВзаиморасчетов), МЕСЯЦ, 1) КАК ПериодВзаиморасчетов,
	|	ОплатаПатентовОбороты.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	РегистрНакопления.бит_ум_ОплатаПатентов.Обороты(
	|			,
	|			&Граница,
	|			,
	|			Организация = &Организация
	|				И ФизическоеЛицо = &ФизическоеЛицо
	|				И Разрез = &Разрез) КАК ОплатаПатентовОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатаПатентовОбороты.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыИРСрезПоследних.Физлицо КАК ФизическоеЛицо,
	|	ДокументыИРСрезПоследних.Серия КАК Серия,
	|	ДокументыИРСрезПоследних.Номер КАК Номер,
	|	ДокументыИРСрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
	|	ДокументыИРСрезПоследних.ДопПоле КАК ДопПоле,
	|	ДокументыИРСрезПоследних.СрокДействия КАК СрокДействия
	|ИЗ
	|	РегистрСведений.бит_ум_ДокументыИР.СрезПоследних(
	|			&Период,
	|			Физлицо = &ФизическоеЛицо
	|				И ВидДокумента = ЗНАЧЕНИЕ(Справочник.бит_ум_ВидыДокументовИР.Патент)
	|				И Разрез = &Разрез) КАК ДокументыИРСрезПоследних
	|ГДЕ
	|	ДокументыИРСрезПоследних.Архив = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыИРСрезПоследних.Разрез КАК Разрез
	|ИЗ
	|	РегистрСведений.бит_ум_ДокументыИР.СрезПоследних(
	|			&Период,
	|			Физлицо = &ФизическоеЛицо
	|				И ВидДокумента = ЗНАЧЕНИЕ(Справочник.бит_ум_ВидыДокументовИР.Патент)) КАК ДокументыИРСрезПоследних
	|ГДЕ
	|	ДокументыИРСрезПоследних.Архив = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Разрез";

	Результат = Запрос.ВыполнитьПакет();

	ВыборкаПериода = Результат[0].Выбрать();
	ВыборкаПатента = Результат[1].Выбрать();

	РазрезыПатентов = Результат[2].Выгрузить().ВыгрузитьКолонку("Разрез");
	ЗаполнитьСписокВыбораРазрезов(РазрезыПатентов);

	ПериодВзаиморасчетов = Неопределено;
	Если ВыборкаПериода.Следующий() Тогда
		ПериодВзаиморасчетов = ВыборкаПериода.ПериодВзаиморасчетов;
	КонецЕсли;
	
	ДатаВыдачиПатента = Неопределено;
	
	Если ВыборкаПатента.Следующий() Тогда
		
		Элементы.ГруппаПатент.Видимость = Истина;
		
		ПатентПодсказка = НСтр("ru = '<b>Серия и номер:</b> %1 %2
                                |<b>Серия и номер бланка:</b> %3
                                |<b>Дата выдачи:</b> %4
                                |<b>Срок действия:</b> %5'");
		
		ПатентПодсказка = СтрШаблон(ПатентПодсказка,
			ВыборкаПатента.Серия, ВыборкаПатента.Номер, ВыборкаПатента.ДопПоле,
			Формат(ВыборкаПатента.ДатаВыдачи, "ДЛФ=D"),
			Формат(ВыборкаПатента.СрокДействия, "ДЛФ=D"));
		
		Если ПериодВзаиморасчетов <> Неопределено Тогда
			ПатентПодсказка = ПатентПодсказка + Символы.ПС + НСтр("ru = '<b>Оплачен по:</b> %1'");
			ПатентПодсказка = СтрШаблон(ПатентПодсказка, Формат(ПериодВзаиморасчетов - 60 * 60 * 24, "ДЛФ=D"));
		КонецЕсли;
		
		ДатаВыдачиПатента = ВыборкаПатента.ДатаВыдачи;
		
		Элементы.ИнформацияОПатенте.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(ПатентПодсказка);
		
	ИначеЕсли РазрезыПатентов.Количество() > 0 Тогда

		// Патенты у работника есть, но ни один не относится к выбранному разрезу. Молча скрывать
		// блок нельзя: пользователь решит, что патент не заведен, хотя ошибся разрезом.
		Элементы.ГруппаПатент.Видимость = Истина;
		Элементы.ИнформацияОПатенте.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'У работника нет патента в выбранном разрезе.
				|Проверьте разрез или заведите патент в документах иностранного работника.';
				|en = 'The employee has no patent in the selected section.
				|Check the section or add the patent to the foreign worker documents.'"));

	Иначе
		Элементы.ГруппаПатент.Видимость = Ложь;
		Элементы.ИнформацияОПатенте.Заголовок = "";
	КонецЕсли;
	
	Если ЗаполнитьДату Тогда
		
		Если ЗначениеЗаполнено(ПериодВзаиморасчетов) Тогда
			Объект.НачалоПериода = ПериодВзаиморасчетов;
		ИначеЕсли ЗначениеЗаполнено(ДатаВыдачиПатента) Тогда	
			Объект.НачалоПериода = ДатаВыдачиПатента;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Подставляет в поле выбора разрезы действующих патентов работника.
// Выбор не ограничивается: квитанцию иногда вводят раньше, чем заводят сам патент.
//
// Параметры:
//   РазрезыПатентов - Массив из СправочникСсылка.бит_ум_РазрезыДокументовИР - разрезы патентов
//                     работника на дату документа.
//
&НаСервере
Процедура ЗаполнитьСписокВыбораРазрезов(РазрезыПатентов)

	СписокВыбора = Элементы.Разрез.СписокВыбора;
	СписокВыбора.Очистить();

	Для Каждого Разрез Из РазрезыПатентов Цикл
		Если СписокВыбора.НайтиПоЗначению(Разрез) = Неопределено Тогда
			СписокВыбора.Добавить(Разрез, ?(ЗначениеЗаполнено(Разрез), Строка(Разрез),
				НСтр("ru = 'Основной патент';en = 'Main patent'")));
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСвязанныеССотрудником()
	
	ИменаКадровыхДанных = "ФизическоеЛицо";
	
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Объект.Сотрудник, ИменаКадровыхДанных, Объект.Дата);
	Если КадровыеДанные.Количество() > 0 Тогда
		Объект.ФизическоеЛицо = КадровыеДанные[0].ФизическоеЛицо;
	Иначе
		Объект.ФизическоеЛицо = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
